network_basics/proj-week/20141156xxx.org
#+TITLE:    《计算机网络》实习报告
#+AUTHOR:    张三(20141156888)
#+EMAIL:     zhangsan@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+STYLE: <link rel="stylesheet" type="text/css" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" />
#+STYLE: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

* SSH
** Tasks
   List at least 10 problems you've met while doing this part of work. While listing your
   problems, you have to tell me:
   1. Description of this problem. For example,
      - What were you trying to do while meeting this problem?
   2. How did you try solving this problem？ For example,
      - Did you google?
   	 - web links?
      - Did you read the man page?
      - Did you ask others for hints?
    
** Problems
   1. 
   2. 
   3. 
   4. 
   5. 
   6. 
   7. 
   8. 
   9. 
   10. 

* HTTP
** Tasks
   1. Create your own website
      - How do I know my web server is running? (=nmap=, =systemctl status apache2=)
      - How to configure it? (=/usr/share/doc/apache2/=, =/etc/apache2/=)
      - Is my apache2 working well? (=/var/log/apache2/=)
      - Where is my homepage? (=/var/www/=)
      - How to write a homepage? (=/var/www/index.html=)
      - How to give every user a homepage? (=~/public_html/index.html=)
        - Examples on =cs3=:
          - [[http://cs3.swfu.edu.cn/~hj]]
          - [[http://cs3.swfu.edu.cn/~rory/]]
          - http://linuxfocus.net/page/2 (Yes, it's hosted by =cs3=.)
          - http://cs3.swfu.edu.cn/~lihui
          - http://cs3.swfu.edu.cn/~20091152132
          - http://cs3.swfu.edu.cn/~20091152067
          - http://cs3.swfu.edu.cn/~20091152011
      
   2. List at least 10 problems you've met while doing this part of work. While listing your
      problems, you have to tell me:
      1. Description of this problem. For example,
         - What were you trying to do while meeting this problem?
      2. How did you try solving this problem？ For example,
         - Did you google?
   	 - web links?
         - Did you read the man page?
         - Did you ask others for hints?
         
** Problems
   1. 
   2. 
   3. 
   4. 
   5. 
   6. 
   7. 
   8. 
   9. 
   10. 

* Email
** SMTP  
*** Install Exim4
    : sudo aptitude install exim4

*** Play with it
    - Your tasks :: 
      - How do I know my SMTP server is running? (=nmap=, =systemctl status exim4=)
      - How to configure it? (=/usr/share/doc/exim4/=, =/etc/exim4/=, 
       	=sudo dpkg-reconfigure exim4-config=)
      - Is my exim4 working well? (=/var/log/exim4/=)
      - How to send/receive emails? (=mail=, =mutt=, =nc server 25=)

** POP3/IMAP4
*** Install Dovecot roundcube
    : sudo aptitude install dovecot-imapd dovecot-pop3d roundcube

*** Play with it
    - Your tasks :: 
      - How do I know my POP3/IMAP4 server is running? (=nmap=, =systemctl status dovecot=)
      - How to configure it? (=/usr/share/doc/dovecot*/=, =/etc/dovecot/=,
        =/usr/share/doc/roundcube-core=, =/etc/roundcube=)
      - Is my dovecot working well? (=/var/log/mail.*/=)
      - How to send/receive emails? (=/usr/share/doc/roundcube-core/=)

** Problems
   1. 
   2. 
   3. 
   4. 
   5. 
   6. 
   7. 
   8. 
   9. 
   10. 

* FTP
** Install vsftpd lftp
   : sudo aptitude install vsftpd lftp
** Play with it
   - Your tasks :: 
     - How do I know my FTP server is running? (=nmap=, =systemctl status vsftpd=)
     - How to configure it? (=/usr/share/doc/vsftpd/=, =/etc/vsftpd.conf=)
     - Is my vsftpd working well? (=/var/log/vsftpd.log=)
     - How to transfer files? (=lftp=)
** Problems
   1. 
   2. 
   3. 
   4. 
   5. 
   6. 
   7. 
   8. 
   9. 
   10. 
  
* IPTables
** Problems
   1. 
   2. 
   3. 
   4. 
   5. 
   6. 
   7. 
   8. 
   9. 
   10. 
