network_basics/proj-week/20141156xxx.html
<!DOCTYPE html>
<html>
<head>
<title>《计算机网络》实习报告</title>
<!-- 2015-07-08 Wed 12:20 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="张三(20141156888)">
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">《计算机网络》实习报告</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. SSH</a>
<ul>
<li><a href="#sec-1-1">1.1. Tasks</a></li>
<li><a href="#sec-1-2">1.2. Problems</a></li>
</ul>
</li>
<li><a href="#sec-2">2. HTTP</a>
<ul>
<li><a href="#sec-2-1">2.1. Tasks</a></li>
<li><a href="#sec-2-2">2.2. Problems</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Email</a>
<ul>
<li><a href="#sec-3-1">3.1. SMTP</a></li>
<li><a href="#sec-3-2">3.2. POP3/IMAP4</a></li>
<li><a href="#sec-3-3">3.3. Problems</a></li>
</ul>
</li>
<li><a href="#sec-4">4. FTP</a>
<ul>
<li><a href="#sec-4-1">4.1. Install vsftpd lftp</a></li>
<li><a href="#sec-4-2">4.2. Play with it</a></li>
<li><a href="#sec-4-3">4.3. Problems</a></li>
</ul>
</li>
<li><a href="#sec-5">5. IPTables</a>
<ul>
<li><a href="#sec-5-1">5.1. Problems</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> SSH</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Tasks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
List at least 10 problems you've met while doing this part of work. While listing your
problems, you have to tell me:
</p>
<ol class="org-ol">
<li>Description of this problem. For example,
<ul class="org-ul">
<li>What were you trying to do while meeting this problem?
</li>
</ul>
</li>
<li>How did you try solving this problem？ For example,
<ul class="org-ul">
<li>Did you google?
<ul class="org-ul">
<li>web links?
</li>
</ul>
</li>
<li>Did you read the man page?
</li>
<li>Did you ask others for hints?
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Problems</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> HTTP</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Tasks</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Create your own website
<ul class="org-ul">
<li>How do I know my web server is running? (<code>nmap</code>, <code>systemctl status apache2</code>)
</li>
<li>How to configure it? (<code>/usr/share/doc/apache2/</code>, <code>/etc/apache2/</code>)
</li>
<li>Is my apache2 working well? (<code>/var/log/apache2/</code>)
</li>
<li>Where is my homepage? (<code>/var/www/</code>)
</li>
<li>How to write a homepage? (<code>/var/www/index.html</code>)
</li>
<li>How to give every user a homepage? (<code>~/public_html/index.html</code>)
<ul class="org-ul">
<li>Examples on <code>cs3</code>:
<ul class="org-ul">
<li><a href="http://cs3.swfu.edu.cn/~hj">http://cs3.swfu.edu.cn/~hj</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/~rory/">http://cs3.swfu.edu.cn/~rory/</a>
</li>
<li><a href="http://linuxfocus.net/page/2">http://linuxfocus.net/page/2</a> (Yes, it's hosted by <code>cs3</code>.)
</li>
<li><a href="http://cs3.swfu.edu.cn/~lihui">http://cs3.swfu.edu.cn/~lihui</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/~20091152132">http://cs3.swfu.edu.cn/~20091152132</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/~20091152067">http://cs3.swfu.edu.cn/~20091152067</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/~20091152011">http://cs3.swfu.edu.cn/~20091152011</a>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li>List at least 10 problems you've met while doing this part of work. While listing your
problems, you have to tell me:
<ol class="org-ol">
<li>Description of this problem. For example,
<ul class="org-ul">
<li>What were you trying to do while meeting this problem?
</li>
</ul>
</li>
<li>How did you try solving this problem？ For example,
<ul class="org-ul">
<li>Did you google?
</li>
<li>web links?
</li>
<li>Did you read the man page?
</li>
<li>Did you ask others for hints?
</li>
</ul>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Problems</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Email</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> SMTP</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Install Exim4</h4>
<div class="outline-text-4" id="text-3-1-1">
<pre class="example">
sudo aptitude install exim4
</pre>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Play with it</h4>
<div class="outline-text-4" id="text-3-1-2">
<dl class="org-dl">
<dt> Your tasks </dt><dd><ul class="org-ul">
<li>How do I know my SMTP server is running? (<code>nmap</code>, <code>systemctl status exim4</code>)
</li>
<li>How to configure it? (<code>/usr/share/doc/exim4/</code>, <code>/etc/exim4/</code>, 
<code>sudo dpkg-reconfigure exim4-config</code>)
</li>
<li>Is my exim4 working well? (<code>/var/log/exim4/</code>)
</li>
<li>How to send/receive emails? (<code>mail</code>, <code>mutt</code>, <code>nc server 25</code>)
</li>
</ul>
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> POP3/IMAP4</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Install Dovecot roundcube</h4>
<div class="outline-text-4" id="text-3-2-1">
<pre class="example">
sudo aptitude install dovecot-imapd dovecot-pop3d roundcube
</pre>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Play with it</h4>
<div class="outline-text-4" id="text-3-2-2">
<dl class="org-dl">
<dt> Your tasks </dt><dd><ul class="org-ul">
<li>How do I know my POP3/IMAP4 server is running? (<code>nmap</code>, <code>systemctl status dovecot</code>)
</li>
<li>How to configure it? (<code>/usr/share/doc/dovecot*/</code>, <code>/etc/dovecot/</code>,
<code>/usr/share/doc/roundcube-core</code>, <code>/etc/roundcube</code>)
</li>
<li>Is my dovecot working well? (<code>/var/log/mail.*/</code>)
</li>
<li>How to send/receive emails? (<code>/usr/share/doc/roundcube-core/</code>)
</li>
</ul>
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Problems</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> FTP</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Install vsftpd lftp</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
sudo aptitude install vsftpd lftp
</pre>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Play with it</h3>
<div class="outline-text-3" id="text-4-2">
<dl class="org-dl">
<dt> Your tasks </dt><dd><ul class="org-ul">
<li>How do I know my FTP server is running? (<code>nmap</code>, <code>systemctl status vsftpd</code>)
</li>
<li>How to configure it? (<code>/usr/share/doc/vsftpd/</code>, <code>/etc/vsftpd.conf</code>)
</li>
<li>Is my vsftpd working well? (<code>/var/log/vsftpd.log</code>)
</li>
<li>How to transfer files? (<code>lftp</code>)
</li>
</ul>
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Problems</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> IPTables</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Problems</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
<li></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 张三(20141156888)</p>
<p class="date">Created: 2015-07-08 Wed 12:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
